export interface Review {
  id: string;
  reviewerName: string;
  reviewerAvatar?: string;
  rating: number;
  postedDate: string;
  comment: string;
}

export const reviewsData: Review[] = [
  {
    id: "1",
    reviewerName: "أنت",
    rating: 4,
    postedDate: "10 نوفمبر 2025",
    comment: "الموصفات خرافية، الكاميرا رهيبة، بشكل واضح الصور هنطلع تحتة",
  },
  {
    id: "2",
    reviewerName: "محمد أحمد",
    rating: 4,
    postedDate: "10 نوفمبر 2025",
    comment: "الموصفات خرافية، الكاميرا رهيبة، بشكل واضح الصور هنطلع تحتة",
  },
  {
    id: "3",
    reviewerName: "محمد أحمد",
    rating: 4,
    postedDate: "10 نوفمبر 2025",
    comment: "الموصفات خرافية، الكاميرا رهيبة، بشكل واضح الصور هنطلع تحتة",
  },
  {
    id: "4",
    reviewerName: "محمد أحمد",
    rating: 4,
    postedDate: "10 نوفمبر 2025",
    comment:
      "واو 😍 من أول ما شفت الإعلان حسيت إن Apple أكيد اهتمت بتفاصيل دقيقة جدا، والفالوا مختارة بعناية عشان تبين جمال الشاشة iPhone 15 Pro Max. الأداء مع شريحة A17 Bionic محسوسة بشكل أسرع من أي وقت مضى، يعني تقدر تشغل كل التطبيقات والألعاب بدون أي تهيج أو تاخير، وكمان إدارة الطاقة محسوسة بشكل ممتاز عشان البطارية تصمد طول اليوم. الكاميرات الثلاثية الجديدة من نطاق جديد، الصور والفيديوهات هنكون بجودة احترافية حتى في الإضاءة المنخفضة، ومع خاصية التصوير الليلي والتثبيت البصري، كل لقطة هنطلع كأنها من أستوديو محترف.",
  },
  {
    id: "5",
    reviewerName: "محمد أحمد",
    rating: 5,
    postedDate: "10 نوفمبر 2025",
    comment: "الموصفات خرافية، الكاميرا رهيبة، بشكل واضح الصور هنطلع تحتة",
  },
  {
    id: "6",
    reviewerName: "محمد أحمد",
    rating: 5,
    postedDate: "10 نوفمبر 2025",
    comment: "الموصفات خرافية، الكاميرا رهيبة، بشكل واضح الصور هنطلع تحتة",
  },
];
